export const mockPosts: PostItem[] = [
  {
    date: "2023-11-05",
    title: "学习TypeScript的心得",
    catalog: "编程",
    desc: "最近在学习TypeScript,感觉TYPES的类型系统非常强大,可以避免很多难以发现的运行时错误,提高代码质量。",
    tags: ["TypeScript", "编程语言"],
  },
  {
    date: "2023-11-05",
    title: "煮好吃的红烧肉",
    catalog: "美食",
    desc: "分享一道家常的红烧肉做法,选择好的五花肉,爆香葱姜,煸炒出香,然后加入调味料慢煨,非常入味。",
    tags: ["家常菜", "红烧肉"],
  },
  {
    date: "2023-11-05",
    title: "爬黄山有哪些注意事项",
    catalog: "旅游",
    desc: "爬黄山需要提前做好准备,带好御寒和防晒用品,留意天气变化,随身携带水和食物。山路陡峭,要注意安全。",
    tags: ["爬山", "黄山"],
  },
  {
    date: "2023-11-05",
    title: "西湖旅游攻略",
    catalog: "旅游",
    desc: "西湖风景秀丽,是杭州著名的景点。建议预订门票,避开节假日高峰期。湖边步道适合徒步,可以租船游湖。西子三潭、苏堤都是不可错过的景点。",
    tags: ["西湖", "杭州"],
  },

  {
    date: "2023-11-05",
    title: "如何省钱自助游日本",
    catalog: "旅游",
    desc: "日本交通发达,可以选择便宜的巴士和地铁。住青年旅舍,选吃便当,赏樱花不需要门票。利用飞猪等APP订最便宜的机票航班。",
    tags: ["日本", "自助游"],
  },

  {
    date: "2023-11-05",
    title: "普者黑攻略",
    catalog: "摄影",
    desc: "普者黑拍摄夜景很棒,要选对组合。可以跟延时摄影结合,拍摄星空和车流。要注意曝光参数的调整,镜头要清洁。",
    tags: ["摄影", "普者黑"],
  },

  {
    date: "2023-11-05",
    title: "春节返乡注意事项",
    catalog: "生活",
    desc: "春节返乡HIGH之前,记得提前买票预订,路上注意安全。回家要给老人拜年,红包要厚一些。在家注意卫生,不要扰民。",
    tags: ["春节", "返乡"],
  },
];
